JAVA_Training/XML_XSLT_XSD/com.xmlexcises/Request3.out.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:tem="http://tempuri.org/"
	xmlns:key="http://schemas.datacontract.org/2004/07/Key2Act.OnPremiseServices.TTTrx.eTimeTrackService"
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header />
	<soap:Body>
		<tem:InsertTransaction>
			<tem:Tenant>Two, Inc.</tem:Tenant>
			<tem:Companydbname>GPDAT</tem:Companydbname>
			<tem:trx>
				<key:aCTINDXField>0</key:aCTINDXField>
				<key:aDRSCODEField />
				<key:aSSETIDField />
				<key:aSSETIDSUFField>0</key:aSSETIDSUFField>
				<key:aSSETINDEXField>0</key:aSSETINDEXField>
				<key:appointmentField />
				<key:bACHNUMBField>ETT29Apr17</key:bACHNUMBField>
				<key:bCHSOURCField />
				<key:basePayRateAmountField>0</key:basePayRateAmountField>
				<key:billing_AmountField>0</key:billing_AmountField>
				<key:cOMPTRNMField>0</key:cOMPTRNMField>
				<key:cOMPTRTPField>0</key:cOMPTRTPField>
				<key:cUSTNMBRField />
				<key:cashFringeField>0</key:cashFringeField>
				<key:certified_PayrollField>0</key:certified_PayrollField>
				<key:cost_Code_Act_Cost_TTDField>0</key:cost_Code_Act_Cost_TTDField>
				<key:cost_Code_AliasField />
				<key:cost_Code_Number_1Field />
				<key:cost_Code_Number_2Field />
				<key:cost_Code_Number_3Field />
				<key:cost_Code_Number_4Field />
				<key:cost_Decimal_PlacesField>0</key:cost_Decimal_PlacesField>
				<key:cost_ElementField>0</key:cost_ElementField>
				<key:cost_Per_UnitField>0</key:cost_Per_UnitField>
				<key:dAYSWRDKField>0</key:dAYSWRDKField>
				<key:dEPRTMNTField />
				<key:dEX_ROW_IDField>0</key:dEX_ROW_IDField>
				<key:dYOFWEEKField>SATURDAY</key:dYOFWEEKField>
				<key:document_SourceField />
				<key:eMPLOYIDField>ALVA0001</key:eMPLOYIDField>
				<key:eQSEQUIPIDField />
				<key:eQS_Cost_CodeField />
				<key:employeeFringeField>0</key:employeeFringeField>
				<key:employeeHomeRCRateField>0</key:employeeHomeRCRateField>
				<key:employeeRateField>0</key:employeeRateField>
				<key:equipment_IDField />
				<key:est_Pct_Complete_to_DateField>0
				</key:est_Pct_Complete_to_DateField>
				<key:fEDCLSSCDField />
				<key:fridayField>0</key:fridayField>
				<key:iTEMDESCField />
				<key:iTEMNMBRField />
				<key:jOBTITLEField />
				<key:jobTransactionRCRateField>0</key:jobTransactionRCRateField>
				<key:lNSEQNBRField>0</key:lNSEQNBRField>
				<key:lOCALTAXField />
				<key:lOCNCODEField />
				<key:labor_Fixed_OHField>0</key:labor_Fixed_OHField>
				<key:labor_OH_PercentageField>0</key:labor_OH_PercentageField>
				<key:mDFUSRIDField />
				<key:mODIFDTField>2017-04-29</key:mODIFDTField>
				<key:modified_TimeField>2017-04-29</key:modified_TimeField>
				<key:mondayField>0</key:mondayField>
				<key:noteField />
				<key:oH_AmountField>0</key:oH_AmountField>
				<key:overhead_1_Cst_Dec_PlcsField>0
				</key:overhead_1_Cst_Dec_PlcsField>
				<key:overhead_1_Cst_Per_UnitField>0
				</key:overhead_1_Cst_Per_UnitField>
				<key:overhead_1_Pct_RateField>0</key:overhead_1_Pct_RateField>
				<key:overhead_1_PercentField>0</key:overhead_1_PercentField>
				<key:overhead_Group_CodeField />
				<key:overhead_Units_1Field>0</key:overhead_Units_1Field>
				<key:ovrhd_1_Unit_Dec_PlacesField>0
				</key:ovrhd_1_Unit_Dec_PlacesField>
				<key:pAYRTAMTField>0</key:pAYRTAMTField>
				<key:pSTGSTUSField>0</key:pSTGSTUSField>
				<key:payroll_Pay_TypeField>0</key:payroll_Pay_TypeField>
				<key:prevailingFringeField>0</key:prevailingFringeField>
				<key:production_Actual_QtyField>0</key:production_Actual_QtyField>
				<key:profit_AmountField>0</key:profit_AmountField>
				<key:profit_Type_NumberField>0</key:profit_Type_NumberField>
				<key:project_NumberField />
				<key:rATECLSSField />
				<key:sEQNUMBRField>0</key:sEQNUMBRField>
				<key:sHFTCODEField />
				<key:sHFTPREMField>0</key:sHFTPREMField>
				<key:sTATECDField />
				<key:sUTASTATField />
				<key:sV_Language_IDField>0</key:sV_Language_IDField>
				<key:saturdayField>0</key:saturdayField>
				<key:sundayField>0</key:sundayField>
				<key:tRXBEGDTField>2017-04-23</key:tRXBEGDTField>
				<key:tRXDSCRNField />
				<key:tRXENDDTField>2017-04-29</key:tRXENDDTField>
				<key:tRXHRUNTField>7</key:tRXHRUNTField>
				<key:tRXQTYField>0</key:tRXQTYField>
				<key:tRX_OriginField />
				<key:tRX_QTY_PRField>0</key:tRX_QTY_PRField>
				<key:tRX_VerifiedField>0</key:tRX_VerifiedField>
				<key:task_CodeField />
				<key:thursdayField>0</key:thursdayField>
				<key:time_InField>2017-04-29</key:time_InField>
				<key:time_In_DateField>2017-04-29</key:time_In_DateField>
				<key:time_OutField>2017-04-29</key:time_OutField>
				<key:time_Out_DateField>2017-04-29</key:time_Out_DateField>
				<key:time_ZoneField />
				<key:transaction_Pay_PeriodField>0</key:transaction_Pay_PeriodField>
				<key:tuesdayField>0</key:tuesdayField>
				<key:uNIONCDField />
				<key:uOFMField />
				<key:uPRTRXCDField>HOUR</key:uPRTRXCDField>
				<key:uSERDEF1Field />
				<key:uSERDEF2Field />
				<key:uSERIDField />
				<key:uSRDAT01Field>2017-04-29</key:uSRDAT01Field>
				<key:uSRDAT02Field>2017-04-29</key:uSRDAT02Field>
				<key:unit_Decimal_PlacesField>0</key:unit_Decimal_PlacesField>
				<key:user_Def_Integer_1Field>0</key:user_Def_Integer_1Field>
				<key:user_Def_Integer_2Field>0</key:user_Def_Integer_2Field>
				<key:user_Define_1Field />
				<key:user_Define_2Field />
				<key:user_Defined_CB_1Field>0</key:user_Defined_CB_1Field>
				<key:user_Defined_CB_2Field>0</key:user_Defined_CB_2Field>
				<key:user_Defined_CB_3Field>0</key:user_Defined_CB_3Field>
				<key:user_Defined_CB_4Field>0</key:user_Defined_CB_4Field>
				<key:user_Defined_Date_3Field>2017-04-29
				</key:user_Defined_Date_3Field>
				<key:user_Defined_Date_4Field>2017-04-29
				</key:user_Defined_Date_4Field>
				<key:user_Defined_Dollar_1Field>0</key:user_Defined_Dollar_1Field>
				<key:user_Defined_Dollar_2Field>0</key:user_Defined_Dollar_2Field>
				<key:user_Defined_Dollar_3Field>0</key:user_Defined_Dollar_3Field>
				<key:user_Defined_Dollar_4Field>0</key:user_Defined_Dollar_4Field>
				<key:user_Defined_Integer_3Field>0</key:user_Defined_Integer_3Field>
				<key:user_Defined_Integer_4Field>0</key:user_Defined_Integer_4Field>
				<key:vARDBAMTField>0</key:vARDBAMTField>
				<key:vENDORIDField />
				<key:wKSWRKDField>0</key:wKSWRKDField>
				<key:wO_Task_IDField />
				<key:wRKRCOMPField />
				<key:wSReserved_CB10Field>0</key:wSReserved_CB10Field>
				<key:wSReserved_CB1Field>0</key:wSReserved_CB1Field>
				<key:wSReserved_CB2Field>0</key:wSReserved_CB2Field>
				<key:wSReserved_CB3Field>0</key:wSReserved_CB3Field>
				<key:wSReserved_CB4Field>0</key:wSReserved_CB4Field>
				<key:wSReserved_CB5Field>0</key:wSReserved_CB5Field>
				<key:wSReserved_CB6Field>0</key:wSReserved_CB6Field>
				<key:wSReserved_CB7Field>0</key:wSReserved_CB7Field>
				<key:wSReserved_CB8Field>0</key:wSReserved_CB8Field>
				<key:wSReserved_CB9Field>0</key:wSReserved_CB9Field>
				<key:wS_Cost_CodeField>1-10-8-1</key:wS_Cost_CodeField>
				<key:wS_Cost_TypeField>1</key:wS_Cost_TypeField>
				<key:wS_Extended_CostField>0</key:wS_Extended_CostField>
				<key:wS_Job_NumberField>CP-201</key:wS_Job_NumberField>
				<key:wS_ModuleField />
				<key:wS_Posting_StatusField>0</key:wS_Posting_StatusField>
				<key:wS_Transaction_DateField>2017-04-29
				</key:wS_Transaction_DateField>
				<key:wS_Transaction_StatusField>0</key:wS_Transaction_StatusField>
				<key:wS_Transaction_TypeField>JOB_COST
				</key:wS_Transaction_TypeField>
				<key:wednesdayField>0</key:wednesdayField>
				<key:wennsoft_AffiliateField />
				<key:wennsoft_BranchField />
				<key:wennsoft_RegionField />
			</tem:trx>
		</tem:InsertTransaction>
	</soap:Body>
</soap:Envelope>
